/**
 * 
[problem]
철수는 해외여행 자금 마련을 위해 아르바이트를 하려고 합니다.
모든 아르바이트는 시작 날짜와 끝 날짜가 정해져 있으며, 급여도 제각각입니다.
철수는 최대한 많은 돈을 벌기 위해 아르바이트를 여러 개 하려고 합니다. 
단, 아르바이트를 동시에 두 개 이상 할 수는 없으며, 아르바이트가 끝나는 날 다른 아르바이트를 시작하는 것은 가능합니다.
각 아르바이트의 시작 날짜와 끝 날짜, 급여가 담긴 배열 part_times가 매개변수로 주어질 때, 
철수가 최대로 벌 수 있는 돈은 얼마인지 return 하도록 solution 함수를 완성해 주세요.

* 제한 사항
-part_times는 2차원 배열입니다.
-part_times의 세로(행) 길이는 1 이상 15 이하입니다.
-part_times의 가로(열) 길이는 3입니다.
-part_times의 원소는 [S, E, C] 형태입니다.
-S는 아르바이트 시작일, E는 아르바이트 종료일, C는 해당 아르바이트의 급여를 나타냅니다.
-S는 항상 E보다 작습니다.
-S와 E는 1 이상 100 이하인 자연수입니다.
-C는 1 이상 1,000 이하인 자연수입니다.
 */

const solution = (part_times) => {
  let answer = 0;

  return answer;
}
